InformationRegisters/СервисСверкиРасчетовРеестрДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СервисСверкиРасчетовРеестрДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СервисСверкиРасчетовСтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СервисСверкиРасчетовВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СервисСверкиРасчетовДокументыПодлежащиеСверке</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СервисСверкиРасчетовРеестрДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОчиститьДанныеПоРегистру(Организация = Неопределено, Контрагент = Неопределено) Экспорт
	
	ОчиститьПоОрганизации = Ложь;
	ОчиститьПоКонтрагенту = Ложь;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ОчиститьПоОрганизации = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ОчиститьПоКонтрагенту = Истина;
	КонецЕсли;
	
	Если Не ОчиститьПоОрганизации
		И Не ОчиститьПоКонтрагенту Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СервисСверкиРасчетовРеестрДокументов.Организация КАК Организация,
	|	СервисСверкиРасчетовРеестрДокументов.Контрагент КАК Контрагент,
	|	СервисСверкиРасчетовРеестрДокументов.Документ КАК Документ,
	|	СервисСверкиРасчетовРеестрДокументов.Статус КАК Статус,
	|	СервисСверкиРасчетовРеестрДокументов.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	СервисСверкиРасчетовРеестрДокументов.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	СервисСверкиРасчетовРеестрДокументов.ДатаДокумента КАК ДатаДокумента,
	|	СервисСверкиРасчетовРеестрДокументов.НомерДокумента КАК НомерДокумента
	|ИЗ
	|	РегистрСведений.СервисСверкиРасчетовРеестрДокументов КАК СервисСверкиРасчетовРеестрДокументов
	|ГДЕ ИСТИНА";
	
	Если ОчиститьПоОрганизации Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИСТИНА", "СервисСверкиРасчетовРеестрДокументов.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИСТИНА", "СервисСверкиРасчетовРеестрДокументов.Контрагент = &Контрагент");
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.РасширенныеРежимыЗамещения = Истина;
	НаборЗаписей.Загрузить(Результат.Выгрузить());
	
	// Устанавливаем блокировки для очистки регистра.
	БлокировкаРегистра      = Новый БлокировкаДанных;
	ЭлементБлокировки       = БлокировкаРегистра.Добавить("РегистрСведений.СервисСверкиРасчетовРеестрДокументов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Если ОчиститьПоОрганизации Тогда 
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	КонецЕсли;
	
	Если ОчиститьПоКонтрагенту Тогда
		ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		БлокировкаРегистра.Заблокировать();
		НаборЗаписей.Записать(РежимЗамещения.Удаление);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Если ОчиститьПоКонтрагенту Тогда
			ШаблонОшибки = НСтр("ru = 'Не удалось очистить регистр документов для сверки по контрагенту %1.
			|Подробное описание ошибки:
			|%2'");
			ТекстОшибки = СтрШаблон(ШаблонОшибки, Строка(Контрагент), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Иначе
			ШаблонОшибки = НСтр("ru = 'Не удалось очистить регистр документов для сверки по организации %1.
			|Подробное описание ошибки:
			|%2'");
			ТекстОшибки = СтрШаблон(ШаблонОшибки, Строка(Организация), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецЕсли;
		ЗаписьЖурналаРегистрации(СервисСверкиРасчетов.ИмяСервиса(), УровеньЖурналаРегистрации.Ошибка, ,, ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ЗаполнитьОтправленныеНаСервисЗначения(Параметры) Экспорт
	
	Если Не СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов() Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем записи помесячно с конца.
	ДатаНачалаСверки    = СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов();
	ДатаОкончанияСверки = КонецМесяца(ТекущаяДатаСеанса());
	
	ПоследнийНеобработанныйМесяц = ПоследнийНеобработанныйМесяц(ДатаНачалаСверки, ДатаОкончанияСверки);
	
	Если Не ЗначениеЗаполнено(ПоследнийНеобработанныйМесяц) Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ДатаНачала    = НачалоМесяца(ПоследнийНеобработанныйМесяц);
	ДатаОкончания = КонецМесяца(ПоследнийНеобработанныйМесяц);
	
	ИмяПроцедуры = "РегистрыСведений.СервисСверкиРасчетовРеестрДокументов.ЗаполнитьОтправленныеНаСервисЗначения()";
	ОбработаноЗаписей = 0;
	
	Пока ОбработаноЗаписей < 1000 
		И ДатаНачала >= ДатаНачалаСверки Цикл
		
		ОбработаноЗаписейЗаМесяц = 0;
		ПроблемныхЗаписей        = 0;
		
		ДанныеИнформационнойБазыКСверке = СервисСверкиРасчетовПереопределяемый.ДанныеИнформационнойБазыКСверке(Неопределено, ДатаНачала, ДатаОкончания, Истина);
		
		ВыборкаОрганизации = ДанныеИнформационнойБазыКСверке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОрганизации.Следующий() Цикл
			
			ВыборкаДокументы = ВыборкаОрганизации.Выбрать();
			
			Пока ВыборкаДокументы.Следующий() Цикл
				
				ОбработаноЗаписей = ОбработаноЗаписей + 1;
				ОбработаноЗаписейЗаМесяц = ОбработаноЗаписейЗаМесяц + 1;
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Организация.Установить(ВыборкаДокументы.Организация);
				НаборЗаписей.Отбор.Контрагент.Установить(ВыборкаДокументы.Контрагент);
				НаборЗаписей.Отбор.Документ.Установить(ВыборкаДокументы.Документ);
				
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				Запись = НаборЗаписей[0];
				
				ДополнительныеСведенияДляОпределенияОперации = 
				СервисСверкиРасчетовПереопределяемый.ДополнительныеСведенияДляОпределенияОперации(ВыборкаДокументы);
				ВидОперации = СервисСверкиРасчетовПереопределяемый.ВидОперации(
				ВыборкаДокументы.Документ, ДополнительныеСведенияДляОпределенияОперации);
				
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаДокументы); 
				
				Запись.Операция     = ВидОперации;
				
				ТаблицаПредставленияДокумента  = СервисСверкиРасчетов.НовыйТаблицаПредставленияДокумента();
				НовыйДокументОрганизации       = ТаблицаПредставленияДокумента.Добавить();
				НовыйДокументОрганизации.Номер = ВыборкаДокументы.НомерДокумента;
				НовыйДокументОрганизации.Дата  = ВыборкаДокументы.ДатаДокумента;
				Запись.ПервичныйДокумент = СервисСверкиРасчетов.ПредставлениеДокументаПоТаблице(ТаблицаПредставленияДокумента);
				
				ТаблицаПредставленияСФ   = СервисСверкиРасчетов.НовыйТаблицаПредставленияДокумента();
				НовыйСФОрганизации       = ТаблицаПредставленияСФ.Добавить();
				Если ВыборкаДокументы.ОбрабатыватьНомерСФ Тогда
					НомерСчетаФактуры = СервисСверкиРасчетов.НомерБезПрефиксовИЛидирующихНулей(ВыборкаДокументы.НомерСчетаФактуры);
				Иначе
					НомерСчетаФактуры = ВыборкаДокументы.НомерСчетаФактуры;
				КонецЕсли;
				НовыйСФОрганизации.Номер = НомерСчетаФактуры;
				НовыйСФОрганизации.Дата  = ВыборкаДокументы.ДатаСчетаФактуры;
				Запись.СчетФактура = СервисСверкиРасчетов.ПредставлениеДокументаПоТаблице(ТаблицаПредставленияСФ);
				
				Запись.Сумма    = ?(ВыборкаДокументы.Сумма >= 0, ВыборкаДокументы.Сумма, - ВыборкаДокументы.Сумма);
				Запись.СуммаНДС = ?(ВыборкаДокументы.СуммаНДС >= 0, ВыборкаДокументы.СуммаНДС, - ВыборкаДокументы.СуммаНДС);
				
				
				Попытка
					
					ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
					
				Исключение
					
					ПроблемныхЗаписей = ПроблемныхЗаписей + 1;
					
					ТекстСообщения = СтрШаблон(НСтр("ru = 'Процедуре %1 не удалось заполнить реквизиты отправленного документа по причине:
					|%2'"), ИмяПроцедуры, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
					ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Предупреждение,
					Метаданные.РегистрыСведений.СервисСверкиРасчетовОбнаруженныеРасхождения,
					,
					ТекстСообщения);
					
				КонецПопытки;
				
			КонецЦикла;
		КонецЦикла;
		
		Если ПроблемныхЗаписей > 0 Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Процедуре %1 не удалось заполнить реквизиты отправленного документа: в %2 из %3 возникли ошибки'"),
			ИмяПроцедуры, ПроблемныхЗаписей, ОбработаноЗаписейЗаМесяц);
			ВызватьИсключение ТекстСообщения;
			
		Иначе
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			Метаданные.РегистрыСведений.СервисСверкиРасчетовОбнаруженныеРасхождения,,
			СтрШаблон(НСтр("ru = 'Процедура %1 обработала очередную порцию документов: %2 записей'"),
			ИмяПроцедуры, ОбработаноЗаписейЗаМесяц));
			
		КонецЕсли;
		
		// Вычислим предыдущий месяц, который будем обрабатывать если обработали меньше 1000 документов.
		ДатаНачала = НачалоМесяца(ДатаНачала - 1);
		ДатаОкончания = КонецМесяца(ДатаНачала);
		Если ДатаНачала < ДатаНачалаСверки Тогда
			Параметры.ОбработкаЗавершена = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПоследнийНеобработанныйМесяц(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СервисСверкиРасчетовРеестрДокументов.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	РегистрСведений.СервисСверкиРасчетовРеестрДокументов КАК СервисСверкиРасчетовРеестрДокументов
	|ГДЕ
	|	СервисСверкиРасчетовРеестрДокументов.ДатаДокумента >= &ДатаНачала
	|	И СервисСверкиРасчетовРеестрДокументов.Статус = ЗНАЧЕНИЕ(Перечисление.СервисСверкиРасчетовСтатусыДокументов.Получено)
	|	И СервисСверкиРасчетовРеестрДокументов.ДатаДокумента <= &ДатаОкончания
	|	И СервисСверкиРасчетовРеестрДокументов.ПервичныйДокумент = """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат НачалоМесяца(Выборка.ДатаДокумента);
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли
